<?php

$Russia = [
    "Московская область" => ['Москва', 'Зеленоград', 'Клин'],
    "Ленинградская область" => ['Санкт-Петербург', 'Сестрорецк', 'Кронштадт','Петергоф'],
    "Рязанская область" => ['Рязань', 'Касимов', 'Скопин'],
    "Псковская область" => ['Псков', 'Себеж', 'Великие Луки']
];

foreach ($Russia as $region => $city) {
     echo $region . ':' . "\n";

    foreach ($city as $key => $value) {

       if (substr($value,0,2) == 'К') {
           echo $value . "\n";
       }
    }
}

?>