<?php

function translate ($content) {

    $word = [

        "а"=>"a",
        "б"=>"b",
        "в"=>"v",
        "г"=>"g",
        "д"=>"d",
        "е"=>"e",
        "ё"=>"e",
        "ж"=>"zh",
        "з"=>"z",
        "и"=>"i",
        "й"=>"i",
        "к"=>"k",
        "л"=>"l",
        "м"=>"m",
        "н"=>"n",
        "о"=>"o",
        "п"=>"p",
        "р"=>"r",
        "с"=>"s",
        "т"=>"t",
        "у"=>"u",
        "ф"=>"f",
        "х"=>"h",
        "ц"=>"tc",
        "ч"=>"ch",
        "ш"=>"sh",
        "щ"=>"shch",
        "ы"=>"y",
        "э"=>"e",
        "ю"=>"iu",
        "я"=>"ia",
        "ь"=>"",
        "ъ"=>""
    ];
    $res = preg_replace('/\s/', '_', strtr($content, $word));
    return $res;
}
echo translate ("как ваши дела");

?>